In [1]:
import os
import pandas as pd

C:\Users\Dell\AppData\Local\Temp\ipykernel_15912\3571106454.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [11]:
cwd = os.getcwd()
BASE_DIR = os.path.dirname(cwd)
DATA_DIR = os.path.join(BASE_DIR, 'data')

In [6]:
os.listdir(DATA_DIR)

['2014.csv',
 '2015.csv',
 '2016.csv',
 '2017.csv',
 '2018.csv',
 '2019.csv',
 '2020.csv',
 '2021.csv',
 '2022.csv',
 '2023.csv',
 '2024.csv']

In [4]:
my_items = [{"category":"Action","title":"My awesome movies"},{"category":"Comedy","title":"Data jokes are us"}]
df = pd.DataFrame(my_items)

In [5]:
df.head()

  category              title
0   Action  My awesome movies
1   Comedy  Data jokes are us

In [6]:
df["category"]

0    Action
1    Comedy
Name: category, dtype: object

In [7]:
df["title"]

0    My awesome movies
1    Data jokes are us
Name: title, dtype: object

In [8]:
df.iloc[0]

category               Action
title       My awesome movies
Name: 0, dtype: object

In [9]:
df.iloc[1]

category               Comedy
title       Data jokes are us
Name: 1, dtype: object

In [12]:
my_data = os.path.join(DATA_DIR, '2024.csv')
print(os.path.exists(my_data))

True

In [13]:
df2 = pd.read_csv(my_data)

In [14]:
df2.head(n=10)

,Rank,Release Group,Worldwide,Domestic,%,Foreign,%.1
0,1,The Beekeeper,"$136,554,503","$57,354,503",42%,"$79,200,000",58%
1,2,Mean Girls,"$100,213,119","$70,213,119",70.1%,"$30,000,000",29.9%
2,3,Argylle,"$66,011,622","$32,878,480",49.8%,"$33,133,142",50.2%
3,4,Night Swim,"$47,324,615","$30,627,650",64.7%,"$16,696,965",35.3%
4,5,Dune 2024 Re-release,"$30,180,165",-,-,"$30,180,165",100%
5,6,Bob Marley: One Love,"$25,321,205","$25,321,205",100%,-,-
6,7,Mobile Suit Gundam Seed Freedom,"$17,275,292",-,-,"$17,275,292",100%
7,8,The Master and Margarita,"$16,184,042",-,-,"$16,184,042",100%
8,9,The Chosen: S4 Episodes 1-3,"$14,151,668","$13,907,439",98.3%,"$244,229",1.7%
9,10,Golden Kamuy,"$13,414,307",-,-,"$13,414,307",100%

In [15]:
df2.tail(n=10)

     Rank                Release Group Worldwide Domestic     %  Foreign   %.1
190   191  One from the Heart: Reprise   $41,576  $41,576  100%        -     -
191   192          Hundreds of Beavers   $41,431  $41,431  100%        -     -
192   193               Main Atal Hoon   $41,105        -     -  $41,105  100%
193   194                     Saindhav   $39,121        -     -  $39,121  100%
194   195            Ape vs. Mecha Ape   $37,591        -     -  $37,591  100%
195   196                    Honeymoon   $37,152        -     -  $37,152  100%
196   197       ESABAT AZEEMA (ARABIC)   $34,145        -     -  $34,145  100%
197   198                  The Muckels   $31,813        -     -  $31,813  100%
198   199     Ambajipeta Marriage Band   $31,665        -     -  $31,665  100%
199   200                The Vourdalak   $31,590        -     -  $31,590  100%